In [4]:
import pandas as pd
import numpy as np
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [5]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
from numpy import nan as NA

In [9]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [16]:
cleaned = data.dropna()

In [17]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [19]:
#Passing how='all' will only      drop rows that are all NA:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [20]:
#To drop columns in the same way, pass axis=1:

data[4] = NA

In [21]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [22]:
data.dropna(axis = 1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [23]:
df = pd.DataFrame(np.random.randn(7,3))

In [25]:
df.iloc[:4, 1] = NA

In [26]:
df.iloc[:2, 2] = NA

In [27]:
df

          0         1         2
0 -0.948055       NaN       NaN
1 -0.953782       NaN       NaN
2 -0.202648       NaN -0.341530
3  0.486743       NaN  0.445992
4 -3.509403 -0.046852  0.107849
5  1.864476 -0.007335  0.444629
6 -0.314067 -1.000935  0.510272

In [28]:
df.dropna()

          0         1         2
4 -3.509403 -0.046852  0.107849
5  1.864476 -0.007335  0.444629
6 -0.314067 -1.000935  0.510272

In [29]:
df.dropna(thresh=2)

          0         1         2
2 -0.202648       NaN -0.341530
3  0.486743       NaN  0.445992
4 -3.509403 -0.046852  0.107849
5  1.864476 -0.007335  0.444629
6 -0.314067 -1.000935  0.510272

In [30]:
#Filling in Missing Data

df.fillna(0)

          0         1         2
0 -0.948055  0.000000  0.000000
1 -0.953782  0.000000  0.000000
2 -0.202648  0.000000 -0.341530
3  0.486743  0.000000  0.445992
4 -3.509403 -0.046852  0.107849
5  1.864476 -0.007335  0.444629
6 -0.314067 -1.000935  0.510272

In [31]:
#Calling fillna with a dict, you      can use a different fill value for each column:

df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.948055  0.500000  0.000000
1 -0.953782  0.500000  0.000000
2 -0.202648  0.500000 -0.341530
3  0.486743  0.500000  0.445992
4 -3.509403 -0.046852  0.107849
5  1.864476 -0.007335  0.444629
6 -0.314067 -1.000935  0.510272

In [32]:
#fillna returns a new object,      but you can modify the existing object in-place:

_ = df.fillna(0, inplace=True)

In [33]:
df

          0         1         2
0 -0.948055  0.000000  0.000000
1 -0.953782  0.000000  0.000000
2 -0.202648  0.000000 -0.341530
3  0.486743  0.000000  0.445992
4 -3.509403 -0.046852  0.107849
5  1.864476 -0.007335  0.444629
6 -0.314067 -1.000935  0.510272

In [34]:
#The same interpolation methods available for reindexing can be      used with fillna:

df = pd.DataFrame(np.random.randn(6, 3))

In [35]:
df.iloc[2:, 1] = NA

In [36]:
df.iloc[4:, 2] = NA

In [37]:
df

          0         1         2
0 -1.826382 -0.073516  0.777734
1  1.938296 -0.404371 -1.354478
2  1.235486       NaN -1.661741
3  0.859628       NaN  1.267727
4 -1.222566       NaN       NaN
5 -0.214305       NaN       NaN

In [38]:
df.fillna(method='ffill')

          0         1         2
0 -1.826382 -0.073516  0.777734
1  1.938296 -0.404371 -1.354478
2  1.235486 -0.404371 -1.661741
3  0.859628 -0.404371  1.267727
4 -1.222566 -0.404371  1.267727
5 -0.214305 -0.404371  1.267727

In [39]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -1.826382 -0.073516  0.777734
1  1.938296 -0.404371 -1.354478
2  1.235486 -0.404371 -1.661741
3  0.859628 -0.404371  1.267727
4 -1.222566       NaN  1.267727
5 -0.214305       NaN  1.267727

In [40]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [41]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [42]:
#Removing duplicates
#Duplicate rows may be found in a DataFrame for any number of reasons. Here is an      example:

In [47]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [48]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [49]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [50]:
#Relatedly, drop_duplicates      returns a DataFrame where the duplicated array is False:

data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [54]:
data['v1'] = range(7)

In [55]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [56]:
#duplicated and drop_duplicates by default keep the first      observed value combination. Passing keep='last' will return the last one:

In [58]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [59]:
#Transforming Data Using a Function or Mapping

In [60]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'pastrami', 'corned beef', 'Bacon', 'pastrami',
                             'honey ham', 'nova lox'], 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [61]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [62]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [63]:
#The map method on a Series accepts a function or dict-like object containing a      mapping, but here we have a small problem in that some of the meats are      capitalized and others are not. Thus, we need to convert each value to      lowercase using the str.lower Series method:

In [64]:
lowercased = data['food'].str.lower()

In [65]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [66]:
data['animal'] = lowercased.map(meat_to_animal)

In [67]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [68]:
#We could also have passed a function that does all the      work:

In [69]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [70]:
#Replacing Values